Improved documentation (#14)
Improved documentation
